def factorial(n):
    """
    Рекурсивна функція для обчислення факторіала з використанням мемоізації.
    """
    if n <= 1:
        return 1
    else:
        return n * factorial(n - 1)

def number_of_groups(n, k):
    """
    Функція для обчислення кількості різних списків переможців при розіграші.

    :param n: Загальна кількість людей (випадків).
    :param k: Кількість людей, які отримали призи.
    :return: Кількість різних списків переможців.
    """
    return factorial(n) // (factorial(n - k) * factorial(k))